app/controllers/api/products_controller.rb

INSERT INTO "products" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 4], ["created_at", "2015-03-27 21:09:22.858054"], ["updated_at", "2015-03-27 21:09:22.858054"]]
---
    def create
      product = @current_user.products.build(product_params)
      if product.save