app/controllers/api/reviews_controller.rb

    def index
      reviews = Review.where(product_id: params[:product_id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1 LIMIT 1  [["product_id", 15]]

    def create
      review = Review.create(review_params)
---
INSERT INTO "reviews" ("product_id", "description", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 12], ["description", "first review"], ["rating", 0], ["created_at", "2015-03-28 19:59:22.724737"], ["updated_at", "2015-03-28 19:59:22.724737"]]