app/controllers/auth_controller.rb

	def authenticate
	  user = User.find_by(email: params[:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "g@g.net"]]